{
  "data": [
    {
      "link": "https://lux-ai.org/",
      "org": "Lux AI Challenge",
      "start": "2021/08",
      "end": null,
      "location": "Worldwide!",
      "details": ["Co-founder of the Lux AI Challenge. We build creative, accessible, inclusive, and engaging AI challenges that necessitate outside of the box engineering and analysis.",
        "Currently collaborating with Kaggle to develop the future of AI challenges and an exciting approach to discovering creative engineering talent and encouraging people to learn AI and programming.",
        "I spearhead the development of our competitions in addition to cultivating our collaborations with Kaggle and other sponsors of our competitions."],
      "role": "Co-founder",
      "logoImage": "assets/luxailogo.png "
    },
    {
      "link": "https://quantco.com/",
      "org": "QuantCo",
      "start": "2021/06",
      "end": "2021/09",
      "location": "Boston, USA",
      "details": ["Developed and researched high precision and accurate white-box function approximation using deep neural nets, decision trees, and boosting. Helps automatically migrate slow, complex, hand-built calculators in old systems to new systems, and learn fast differentiable approximations of these functions for analysis purposes. Results beat LGBM, deep neural nets (by themselves), and other methods by 100x or by being feasible in high dimensions.",
        "Developing OCR+NLP tools for analysis of insurance documents for automatic categorization of insurance types and their properties",
        "Used Pytorch, Jax, Flax, Optax, scikit learn, scipy, Pandas, GCP"],
      "role": "Machine Learning Engineer Intern",
      "logoImage": "assets/logo_quantco_black.svg "
    },
    {
      "link": "https://cseweb.ucsd.edu/~haosu/lab/group.html",
      "org": "SU Lab at UCSD",
      "start": "2021/01",
      "end": null,
      "location": "San Diego, USA",
      "details": [
        "Researching Reinforcement Learning (RL) and Robotics under Professor Hao Su. Currently researching topics in RL and robotics. Previously built gym environments for RL benchmarks to test RL agents on SAPIEN, a simulated part-based interactive, 3D environment.",
        "Our work on the environments and generalizable RL was accepted to NeurIPS 2021 (Benchmark and Datasets track): <a href='https://arxiv.org/abs/2107.14483'>https://arxiv.org/abs/2107.14483</a>",
        "Environments are being used for our lab's manipulation skill challenge sponsored by Qualcomm AI Research: <a href='https://github.com/haosulab/ManiSkill'>https://github.com/haosulab/ManiSkill</a>. Furthermore, I'm developing the ManiSkill challenge platform full stack with Python, Docker, MongoDB, Typescript."
      ],
      "role": "AI Research Intern",
      "logoImage": "assets/sulab.png "
    },
    {
      "link": "http://protolab.ucsd.edu",
      "org": "ProtoLab / Design Lab",
      "start": "2020/08",
      "end": null,
      "location": "San Diego, USA",
      "details": [
        "Currently researching at the intersection of HCI and AI. Specifically looking at how to encourage more positive results from AI models and increase trust in data and predictions through humans in ML, crowdsourcing and more. Also researching novel approaches to data discussion.",
        "Working under Professor Steven Dow and Brian McInnis"
      ],
      "role": "Undegraduate Researcher",
      "logoImage": "assets/dlab.jpg"
    },
    {
      "link": "https://launchdarkly.com/",
      "org": "LaunchDarkly",
      "start": "2020/06",
      "end": "2020/09",
      "location": "Oakland, USA",
      "details": [
        "Part of the full stack team Squad Oinx. Worked on feature workflows and semantic patches to enable state independent scheduling of feature flagging as well as a new approval review system for feature flagging, allowing users to release complex features with confidence",
        "Developed REST API with Go for backend and React + Typescript for frontend"
      ],
      "role": "Software Engineering Intern",
      "logoImage": "assets/ld.png"
    },
    {
      "link": "https://www.taosdata.com/en/",
      "org": "TAOS Data",
      "start": "2019/06",
      "end": "2019/09",
      "location": "Beijing, China",
      "details": [
        "Independently developed the company website and integrated Wordpress as a headless CMS, serving up to 18k+ daily users",
        "Developed a Node.js Connector for the company’s main product, TDengine, an open source big data platform with 14000+ stars",
        "Created a C interface, to enable high-speed interaction with TDengine. Implemented subscription, async, and stream functionality"
      ],
      "role": "Full Stack Developer Intern",
      "logoImage": "assets/taosdata.png"
    }
  ]
}